using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace CredentialsGeneratorLibrary
{
    public class Generator
    {
        private readonly static Random random = new Random();

        public static bool RandomVIP() =>
            random.Next(0, 2) == 1;

        public static string RandomName()
        {
            string[] names = { "Юрий","Богдан","Оскар","Родион","Филипп","Макар","Йошка","Лука","Цефас","Владлен","Йомер","Цицерон",
                                "Йоган","Яков","Нестор","Адам","Роман","Степан","Елисей","Даниил","Сергей","Максим","Станислав","Георгий",
                                "Дмитрий","Артём","Фёдор","Михаил","Леон","Лев","Александр","Захар","Иван","Роберт","Алексей","Давид",
                                "Владимир","Лука","Глеб","Матвей","Никита","Егор","Марк","Руслан","Вячеслав","Тимофей","Мирон","Виктор",
                                "Илья","Савелий","Андрей","Кирилл","Даниэль","Эмиль","Павел","Константин","Денис","Игорь","Арсений",
                                "Владислав","Семён","Филипп","Николай","Юрий","Демид","Гордей","Евгений","Святослав","Родион","Пётр",
                                "Богдан","Билал","Вадим","Платон","Олег","Тихон","Демьян","Данил","Артемий","Всеволод","Ярослав",
                                "Леонид","Али","Марат","Данила","Антон","Тимур","Дамир","Макар","Василий","Григорий","Анатолий","Ян",
                                "Герман","Артур","Валерий","Назар","Савва","Борис","Ибрагим","Эмир","Эрик","Данис","Виталий","Арсен",
                                "Камиль","Марсель","Мирослав","Яков","Эмин","Ростислав","Тигран","Рустам","Мартин","Серафим"};
            return names[random.Next(0, names.Length - 1)];
        }

        public static string RandomSurname()
        {
            string[] surnames = { "Недбайло","Зайцев","Назаров","Кличко","Молчанов",
                                    "Лукашенко","Шарапов","Панов","Логинов","Дементьев",
                                    "Владимиров","Спивак","Мишин","Семёнов","Гребневский" };
            return surnames[random.Next(0, surnames.Length - 1)];
        }
    }
}